Repository: Tjoosten/php-warrior
Catalog: i18n/*.po
Languages: ja_jp, ru_ro

source: - turn %s -
ja_jp: - ターン %s -
ru_ro: - Поворот %s -

source: Add an if/else condition using $warrior->feel()->is_empty() to decide whether to $warrior->attack() or $warrior->walk().
ja_jp: $warrior->feel()->is_empty()を使ってif/else条件を作り、$warrior->attack()か$warrior->walk()を行おう。
ru_ro: Добавить если / другое состояние, используя $ Warrior-> чувство () -> IS_EMPTY (), чтобы решить, следует ли $ Warrior-> атаки () или $ Warrior-> прогулку ().

source: Another large room, but with several enemies blocking your way to the stairs.
ja_jp: また大きな部屋だ。しかしいくつかの敵が階段への道を妨げている。

source: Another level has been added since you started epic, going back to normal mode.
ja_jp: エピックモードを始めてからレベルが追加されている。ノーマルモードに戻ります。
ru_ro: Другой уровень был добавлен, так как Вы начали эпос, возвращаясь к нормальному режиму.

source: Another ticking sound, but some sludge is blocking the way.
ja_jp: またコチコチと音がしている。しかしスライムが道を妨げている。

source: Attacks a unit in given direction (forward by default).
ja_jp: 指定された方向のユニットを攻撃する。 (forward がデフォルト)
ru_ro: Атакует устройство в заданном направлении (вперед по умолчанию).

source: Avoid fighting enemies at first. Use $warrior->listen() and space->is_ticking() and quickly rescue those captives.
ja_jp: 最初は敵と戦うのを避けよう。$warrior->listen()とspace->is_ticking()で急いで捕虜を救助しよう。

source: Be careful not to die! Use $warrior->health() to keep an eye on your health, and $warrior->rest() to earn 10% of max health back.
ja_jp: 死なないように注意。$warrior->health()で体力に注意し、$warrior->rest()で上限の10%の体力を回復しよう。

source: Be careful not to let the ticking captive get caught in the flames. Use $warrior->distance_of() to avoid the captives.
ja_jp: コチコチと音がしている捕虜に爆風をあてないように注意しよう。$warrior->distance_of()で捕虜を避けよう。

source: Be sure to bind the surrounding enemies before fighting. Check your health before detonating explosives.
ja_jp: 戦う前に周囲の敵を拘束しよう。爆発を起こす前は自分の生命力に注意しよう。

source: Binds a unit in given direction to keep him from moving (forward by default).
ja_jp: 指定された方向のユニットを束縛する。 (forward がデフォルト)
ru_ro: Связывает устройство в заданном направлении, чтобы держать его от переезда (вперед по умолчанию).

source: CONGRATULATIONS! You have climbed to the top of the tower and rescued the fair maiden PHP.
ja_jp: おめでとう! きみは塔の頂上に到達し、麗しいPHP姫を救出した。
ru_ro: ПОЗДРАВЛЯЕМ! Вы поднялись на вершину башни и спас девица PHP.

source: Call $warrior->bind($direction) to bind an enemy to keep him from attacking. Bound enemies look like captives.
ja_jp: $warrior->bind($direction)で敵を拘束し攻撃されなくしよう。拘束された敵は捕虜のように見える。

source: Call $warrior->feel($direction)->is_enemy() in each direction to make sure there isn't an enemy beside you (attack if there is). Call warrior.rest! if you're low and health when there are no enemies around.
ja_jp: $warrior->feel($direction)->is_enemy()でそれぞれの方向を調べ、敵がいないか調べよう。体力が少なく、周囲に敵が居なければ$warrior->rest()で休息しよう。

source: Call $warrior->walk() to walk forward in the Player 'play_turn' method.
ja_jp: Playerの 'play_turn' メソッドの中で $warrior->walk() を呼び出して前に歩こう。
ru_ro: Позвоните $ Warrior-> прогулку (), чтобы идти вперед в методе Игрока 'play_turn ».

source: Calling $warrior->look() will return an array of Spaces. If the first two contain enemies, detonate a bomb with $warrior->detonate().
ja_jp: $warrior->look()は空間を配列で取得する。最初の2つが敵であれば、$warrior->detonate()で爆弾を起爆しよう。

source: Choose %s by typing the number:
ja_jp: 番号で %s を選択してください:
ru_ro: Выберите %s , введя номер:

source: Clear Bonus: %s
ja_jp: クリアボーナス: %s
ru_ro: Ясно Бонус: %s

source: Count the number of enemies around you. Bind an enemy if there are two or more.
ja_jp: 周囲の敵の数を数え、敵が2体以上なら拘束しよう。

source: Determine the direction of the ticking captive and kill any enemies blocking that path. You may need to bind surrounding enemies first.
ja_jp: コチコチと音を立てている捕虜を調べ、進路上の敵を倒そう。周囲の敵を先に拘束する必要があるかもしれない。

source: Detonate a bomb in a given direction (forward by default) which damages that space and surrounding 4 spaces (including yourself).
ja_jp: 指定された方向で爆弾を起爆する。(前方がデフォルト)起爆した空間と周囲4マスにダメージを与える。(自分自身も含まれる)

source: Detonate a bomb when you see a couple enemies ahead of you ($warrior->look()). Watch out for your health too.
ja_jp: $warrior->look()で見て、複数の敵が前方にいれば、爆弾を起爆しよう。自分の生命力にも注意。

source: Don't forget to constantly check if you're taking damage. Rest until your health is full if you aren't taking damage.
ja_jp: ダメージを受けていないかを常に調べよう。ダメージを受けていない時に生命力が全快するまで休息しよう。
ru_ro: Не забудьте постоянно проверять, если вы принимаете ущерб. Отдых до Вашего здоровья полном объеме, если вы не принимаете повреждения.

source: Don't just keep shooting the bow while you are being attacked from behind.
ja_jp: 後方から攻撃されている時は弓を撃ち続けてはいけない。
ru_ro: Не просто продолжать стрелять из лука, а на тебя нападают сзади.

source: Enter a name for your warrior:
ja_jp: きみの戦士の名前を入力せよ:
ru_ro: Введите имя для вашего воина:

source: First level has been generated. See the phpwarrior/%s/README for instructions.
ja_jp: 最初のレベルが生成された。phpwarrior/%s/README の説明を見てください。
ru_ro: Была сформирована Первый уровень. См phpwarrior / %s / README для получения инструкций.

source: Gain 10% of max health back, but do nothing more.
ja_jp: 生命力が最大の10%回復。ただし他の行動は出来ない。
ru_ro: Получите 10% от максимального здоровья спины, но ничего не делают больше.

source: Hurry and rescue captives first that have space->is_ticking(), they'll soon go!
ja_jp: 空間がspace->is_ticking()しているなら急いで捕虜を救出しよう。すぐに爆発してしまうぞ!

source: If going towards a unit is the same direction as the stairs, try moving another empty direction until you can safely move toward the enemies.
ja_jp: 階段と同じ方向にユニットが居る場合は、別の空っぽの空間に移動して敵を避けて移動しよう。

source: It is too dark to see anything, but you smell sludge nearby.
ja_jp: 真っ暗で何も見えない。しかしスライムが近くにいる臭いがする。
ru_ro: Это слишком темно, чтобы увидеть что-либо, но вы чувствуете запах ила поблизости.

source: Just like walking, you can attack() and feel in multiple directions (forward, left, right, backward).
ja_jp: 歩くのと同様に、attack()とfeel()は複数の方向に実行できる。forward, left, right, backward)

source: Kills you and all surrounding units. You probably don't want to do this intentionally.
ja_jp: 自分自身と周囲の全てのユニットを殺す。意図的にこれを行うことは無いだろう。

source: Level
ja_jp: レベル
ru_ro: Уровень

source: Level Grade: %s
ja_jp: レベル評価: %s
ru_ro: Уровень Оценка: %s

source: Level Score: %s
ja_jp: レベル得点: %s
ru_ro: Уровень Счет: %s

source: Move in the given direction (forward by default).
ja_jp: 指定された方向へ歩く。 (forward がデフォルト)
ru_ro: Перемещение в данном направлении (вперед по умолчанию).

source: Never before have you seen a room so full of sludge. Start the fireworks!
ja_jp: 見たこと無いほどスライムだらけの部屋だ。花火の時間だ!

source: New Profile
ja_jp: 新しいプロファイル
ru_ro: Новый Профиль

source: No new abilities this time, but you must be careful not to rest while taking damage. Save a $this->health instance variable and compare it on each turn to see if you're taking damage.
ja_jp: 今回は新しい能力は無い。しかしダメージを受けている時に休息しないように注意しよう。 $this->healthインスタンス変数を保持、毎ターン比較してダメージを受けていないか調べよう。

source: No phpwarrior directory found, would you like to create one?
ja_jp: phpwarrior ディレクトリが見つかりません。新しく作りますか?
ru_ro: Нет phpwarrior каталог найден, вы хотели бы создать?

source: Only one action can be performed per turn.
ja_jp: 各ターンでは一回しか行動できない。
ru_ro: Только одно действие может быть выполнено за ход.

source: Pass a Space as an argument, and it will return an integer representing the distance to that space.
ja_jp: 空間(Space)を引数に与え、その空間への方向を取得する。

source: Pass a Space as an argument, and the direction (left, right, forward, backward) to that space will be returned.
ja_jp: 与えられた空間への方向を得る。(left, right, forwardm backword)

source: Quickly kill the sludge and rescue the captive before the bomb goes off. You can't simply go around them.
ja_jp: 爆弾が爆発するまえに素早くスライムを倒し、捕虜を救助しよう。単純に進むことはできない。

source: Rescue a captive from his chains (earning 20 points) in given direction (forward by default).
ja_jp: 指定された方向の捕虜を鎖から救助する。(20点を獲得)

source: Returns a Space for the given direction (forward by default).
ja_jp: 指定された方向の空間を取得する。 (forward がデフォルト)
ru_ro: Возвращает пространство для данного направления (вперед по умолчанию).

source: Returns an array of all spaces which have units in them.
ja_jp: ユニットのいる全てのSpace(空間)を配列で取得する。

source: Returns an array of up to three Spaces in the given direction (forward by public functionault).
ja_jp: 指定された方向の空間3つまで取得する。 (forward がデフォルト)

source: Returns an integer representing your health.
ja_jp: きみの生命力を整数で取得する。

source: Returns the direction (left, right, forward, backward) the stairs are from your location.
ja_jp: 現在の位置から階段への方向を得る。(left, right, forward, backward)
ru_ro: Возвращает направление (влево, вправо, вперед, назад) Лестницы от вашего местоположения.

source: Rotate left, right or backward (default)
ja_jp: 左、右または後ろへ回転する。(デフォルトは後方)

source: See the updated README in the phpwarrior/%s directory.
ja_jp: phpwarrior/%s ディレクトリの更新された README を見てください。
ru_ro: Смотрите обновленную README в phpwarrior / %s каталоге.

source: See the updated README in the rubywarrior/#{profile.directory_name} directory.
ja_jp: 更新されたREADMEを見てください。
ru_ro: Смотрите обновленную README в rubywarrior / # {} profile.directory_name каталоге.

source: Set $this->health to your current health at the end of the turn. If this is greater than your current health next turn then you know you're taking damage and shouldn't rest.
ja_jp: ターンの終わりに$this->healthに現在の生命力をセットしよう。次のターンでこの数値が現在の生命力より大きければ、きみはダメージを受けていて安んではいけない。
ru_ro: Установить $ this-> здоровье вашего текущего здоровья в конце хода. Если это больше, чем ваш текущий здравоохранения следующем повороте, то вы знаете, вы принимаете ущерб и не должны отдыхать.

source: Shoot your bow & arrow in given direction (forward by default).
ja_jp: 指定された方向へ射撃する。 (forward がデフォルト)

source: Silence. The room feels large, but empty. Luckily you have a map of this tower to help find the stairs.
ja_jp: 静寂。部屋は大きく空っぽのようだ。幸い、きみは階段を示す地図を持っている。

source: Sorry, you failed level %s. Change your script and try again.
ja_jp: 残念。君はレベル %s に失敗した。スクリプトを変更し再挑戦してください。
ru_ro: К сожалению, вам не удалось уровень %s . Изменить сценарий и попробуйте еще раз.

source: Stairs
ja_jp: 階段
ru_ro: Лестница

source: Starting Level %s
ja_jp: レベル %s を開始
ru_ro: Начиная Уровень %s

source: Staying on current level. Try to earn more points next time.
ja_jp: 同じレベルに留まります。次はさらに高得点を目指しましょう。
ru_ro: Пребывание на текущем уровне. Попробуйте заработать больше очков в следующий раз.

source: Success! You have found the stairs.
ja_jp: 成功! きみは階段を発見した。
ru_ro: Удачи! Вы нашли по лестнице.

source: The air feels thicker than before. There must be a horde of sludge.
ja_jp: 空気がじめじめとしている。スライムの群れがいるに違いない。
ru_ro: Воздух считает толще, чем раньше. Там должны быть орда ила.

source: The wall behind you feels a bit further away in this room. And you hear more cries for help.
ja_jp: 背後の離れたところに壁があり、助けを求める声が聞こえる。
ru_ro: Стена позади вас чувствует себя немного дальше в этой комнате. И вы услышите больше крики о помощи.

source: Time Bonus: %s
ja_jp: タイムボーナス: %s
ru_ro: Время Бонус: %s

source: Time to hone your skills and apply all of the abilities that you have learned.
ja_jp: 習得した全ての能力を駆使しよう。
ru_ro: Время, чтобы отточить свои навыки и применять все способности, которые вы узнали.

source: Tip
ja_jp: ヒント
ru_ro: Наконечник

source: To practice a level, use the -l option: php-warrior -l 3
ja_jp: レベルを練習するには -l optionを使用: php-warrior -l 3
ru_ro: Чтобы практиковать уровень, используйте опцию -l: N N PHP-воина -l 3

source: Total Score: %s
ja_jp: 総合得点: %s
ru_ro: Общая оценка: %s

source: Unable to continue without directory.
ja_jp: ディレクトリ無しでは継続できません。
ru_ro: Невозможно продолжить без каталога.

source: Use $warrior->direction_of_stairs() to determine which direction stairs are located. Pass this to $warrior->walk() to walk in that direction.
ja_jp: $warrior->direction_of_stairs()で階段の方向を調べよう。方向を$warrior->walk()に渡してその方向へ歩こう。

source: Use $warrior->feel()->is_captive() to see if there is a captive and $warrior->rescue() to rescue him. Don't attack captives.
ja_jp: $warrior->feel()->is_captive()で捕虜がいるかを調べ、$warrior->rescue()で救出しよう。捕虜を攻撃してはいけない。
ru_ro: Используйте $ Warrior-> чувство () -> is_captive (), чтобы увидеть, если есть в плен и $ Warrior-> спасательные (), чтобы спасти его. Не нападайте на пленных.

source: Use $warrior->feel()->is_empty() to see if there is anything in front of you, and $warrior->attack() to fight it. Remember, you can only do one action per turn.
ja_jp: $warrior->feel()->is_empty()で前方を調べよう。何かがあれば$warrior->attack()で攻撃しよう。ただし一回のターンでは一度しか行動できない。

source: Use $warrior->listen() to find spaces with other units, and $warrior->direction_of() to determine what direction they're in.
ja_jp: $warrior->listen()で他のユニットのいる場所を探し、$warrior->direction_of()でその方向を調べよう。

source: Use $warrior->look() to determine your surroundings, and $warrior->shoot() to fire an arrow.
ja_jp: $warrior->look()で自分の周囲を確認し、$warrior->shoot()で矢を撃とう。

source: Walk backward if you are taking damage from afar and do not have enough health to attack. You may also want to consider walking backward until $warrior->feel('backward')->is_wall().
ja_jp: 遠くから攻撃されていて、十分な生命力が無い場合は後退しよう。$warrior->feel('backward')->is_wall()までは歩き続けるのも良いだろう。

source: Walk towards an enemy or captive with $warrior->walk($warrior->direction_of($warrior->listen()[0])), once empty($warrior->listen()) then head for the stairs.
ja_jp: $warrior->walk($warrior->direction_of($warrior->listen()[0]))で敵か捕虜に向かって歩こう。empty($warrior->listen())になったら階段を目指すのだ。

source: Warrior
ja_jp: 戦士
ru_ro: Воин

source: Warrior Abilities
ja_jp: 戦士の能力
ru_ro: Воин Способности

source: Watch your back.
ja_jp: 背後に注意。
ru_ro: Следите за спиной.

source: Welcome to PHP Warrior
ja_jp: PHP Warrior へようこそ
ru_ro: Добро пожаловать в PHP Warrior

source: What's that ticking? Some captives have a timed bomb at their feet!
ja_jp: 何かがコチコチと音を立てている。捕虜の足に時限爆弾が仕掛けられている!

source: When there is no enemy ahead of you call $warrior->rest() until health is full before walking forward.
ja_jp: 前方に敵がいない時は$warrior->rest()で体力を回復しよう。生命力が完全になったら前に歩こう。

source: When you're done editing player.php, run the php-warrior command again.
ja_jp: player.phpを編集したら、 phpwarrior コマンドをもう一度実行してください。
ru_ro: Когда вы закончите редактирование player.php, выполните команду PHP-воин снова.

source: Wizards are deadly but low in health. Kill them before they have time to attack.
ja_jp: 魔法使いは脅威だが、生命力が弱い。攻撃の間を与えずに倒せ。
ru_ro: Мастера смертельно, но с низким здоровьем. Убейте их, прежде чем они успели атаковать.

source: Would you like to continue on to epic mode?
ja_jp: エピックモードで続けますか?
ru_ro: Хотите продолжить на эпическом режиме?

source: Would you like to continue on to the next level?
ja_jp: 次のレベルに進みますか?
ru_ro: Хотите продолжить на следующий уровень?

source: Would you like to read the additional clues for this level?
ja_jp: このレベルの追加ヒントを読みますか?
ru_ro: Хотите, чтобы прочитать дополнительные ключи для этого уровня?

source: You are not as effective at attacking backward. Use $warrior->feel()->is_wall() and $warrior->pivot() to turn around.
ja_jp: 後方へ攻撃するのは効果的ではない。 $warrior->feel()->is_wall()と$warrior->pivot()を使って振り向こう。
ru_ro: Вы не так эффективны при нападении назад. Используйте $ Warrior-> чувство () -> is_wall () и $ Warrior-> стержнем (), чтобы повернуть.

source: You can feel the stairs right next to you, but are you sure you want to go up them right away?
ja_jp: きみのすぐ隣に階段があるようだ。本当にすぐ上の階に進んでいいのだろうか?

source: You can hear bow strings being stretched.
ja_jp: 弓を引く音が聞こえる。
ru_ro: Вы можете услышать лук строки растягивается.

source: You can walk backward by passing 'backward' as an argument to walk(). Same goes for feel(), rescue() and attack(). Archers have a limited attack distance.
ja_jp: 'backward'をwalk()の引数に渡せば後ろに歩くことができる。feel()、rescue()、attack()も同様だ。弓兵は射程距離に限界がある。

source: You discover a satchel of bombs which will help when facing a mob of enemies.
ja_jp: きみは手投げ式の爆弾を見つけた。敵の群れに出会った際に役立ちそうだ。

source: You feel a wall right in front of you and an opening behind you.
ja_jp: 正面は壁のようだ。そして背後が開けている。
ru_ro: Вы чувствуете правой стене перед вами и отверстие позади вас.

source: You feel slime on all sides, you're surrounded!
ja_jp: 全ての方向にスライムの気配を感じる。君は囲まれている!

source: You hear cries for help. Captives must need rescuing.
ja_jp: 助けを求める叫びが聞こえる。捕虜を救出しなければならない。
ru_ro: Вы слышите крики о помощи. Пленники должны нуждаться для спасения.

source: You hear the mumbling of wizards. Beware of their deadly wands! Good thing you found a bow.
ja_jp: 魔法使いのもごもごとした声が聞こえる。強力な魔法の杖に気をつけろ。幸い君は弓矢を発見した。
ru_ro: Вы слышите бормотание мастеров. Остерегайтесь их смертельных палочки! Хорошо, что вы нашли лук.

source: You see before yourself a long hallway with stairs at the end. There is nothing in the way.
ja_jp: きみの前には長い廊下があり奥には階段が見える。他には何もない。
ru_ro: Вы видите перед собой длинный коридор с лестницей в конце. Там нет ничего в пути.

source: You'll get more points for clearing the level first. Use $warrior->feel()->is_stairs() and $warrior->feel()->is_empty() to determine where to go.
ja_jp: レベル内を先に探索すればさらに得点できる。 $warrior->feel()->is_stairs()と$warrior->feel()->is_empty()で行き先を決めよう。

source: Your average grade for this tower is: %s
ja_jp: あなたのこの塔の平均評価は: %s
ru_ro: Ваш средний балл для этой башни является: %s

source: Your ears become more in tune with the surroundings. Listen to find enemies and captives!
ja_jp: 周囲に対して耳を研ぎ澄まし、敵と捕虜の気配を感じる。

source: attacks %1$s and hits %2$s
ja_jp: %1$sを攻撃し、%2$sに命中。
ru_ro: атаки %1$s и парад %2$s

source: attacks %s and hits nothing
ja_jp: %sを攻撃し、空振りした。
ru_ro: атаки %s и не парад ничего

source: backward
ja_jp: 後方
ru_ro: назад

source: binds %1$s and restricts %2$s
ja_jp: %1$sを束縛し、%2$sを拘束。

source: binds %s and restricts nothing
ja_jp: %sを束縛し、空振りした。
ru_ro: связывает %s и не ограничивает ничего

source: bumps into %s
ja_jp: %sに衝突した
ru_ro: врезается в %s

source: caught in bomb's flames which detonates ticking explosive
ja_jp: 爆風が時限爆弾を誘爆させる。

source: detonates a bomb %s launching a deadly explosion.
ja_jp: %sで爆弾を起爆し、強力な爆発が起こった。

source: dies
ja_jp: 死亡
ru_ro: умирает

source: does nothing
ja_jp: 何もしない。
ru_ro: ничего не делает

source: earns %s points
ja_jp: %s点を獲得。
ru_ro: зарабатывает %s точек

source: east
ja_jp: 東
ru_ro: восток

source: explodes, collapsing the ceiling and damanging every unit.
ja_jp: 爆発し、天井が崩れ落ち全てのユニットがダメージを受ける。

source: forward
ja_jp: 前方
ru_ro: вперед

source: is already fit as a fiddle
ja_jp: すでにとても元気だ。
ru_ro: уже как огурчик

source: is ticking
ja_jp: カチカチと音を立てている。

source: left
ja_jp: 左
ru_ro: слева

source: north
ja_jp: 北
ru_ro: север

source: nothing
ja_jp: 何もない
ru_ro: ничего

source: pivots %s
ja_jp: %sを向いた。

source: receives %1$s health from resting, up to %2$s health
ja_jp: 休息により%1$sの生命力を得て、%2$sに回復。
ru_ro: получает %1$s здоровья от отдыха, до %2$s здоровья

source: released from bonds
ja_jp: 拘束から解放された
ru_ro: освобожден от облигаций

source: right
ja_jp: 右
ru_ro: право

source: score
ja_jp: 点数
ru_ro: Гол

source: shoots %1$s and hits %2$s
ja_jp: %1$sを射撃し、%2$sに命中。

source: shoots and hits nothing
ja_jp: %sを射撃し、空振りした。

source: south
ja_jp: 南
ru_ro: на юг

source: takes %1$s damage, %2$s health power left
ja_jp: %1$s のダメージを受け、残り生命力 %2$s
ru_ro: занимает %1$s ущерб, %2$s питания здоровья левый

source: unbinds %1$s and rescues %2$s
ja_jp: %1$sを救助し、%2$sを解放した。

source: unbinds %s and rescues nothing
ja_jp: %sを救助し、空振りした。

source: walks %s
ja_jp: %sに歩いた。
ru_ro: прогулки %s

source: wall
ja_jp: 壁
ru_ro: стена

source: west
ja_jp: 西
ru_ro: запад

source: Be careful not to die! Use warrior.health to keep an eye on your health, and warrior.rest! to earn 10% of max health back.
ru_ro: Будьте осторожны, чтобы не умереть! Используйте warrior.health держать глаз на вашем здоровье, и warrior.rest! заработать 10% от максимального здоровья спины.

source: No new abilities this time, but you must be careful not to rest while taking damage. Save a @health instance variable and compare it on each turn to see if you\re taking damage.
ru_ro: Нет новых способностей в этот раз, но вы не должны быть осторожны, чтобы не отдыхать, принимая ущерб. Сохранитьhealth переменную экземпляра и сравнить его на каждом повороте, чтобы увидеть, если вы \ вновь получении урона.

source: Run rubywarrior again to play epic mode.
ru_ro: Запустите rubywarrior снова играть эпический режим.

source: Use warrior.feel.empty? to see if there is anything in front of you, and warrior.attack! to fight it. Remember, you can only do one action (ending in !) per turn.
ru_ro: Используйте warrior.feel.empty? чтобы увидеть, если есть что-нибудь перед вами, и warrior.attack! для борьбы с ней. Помните, что вы можете сделать только одно действие (окончание в!) За свою.

source: Use warrior.look to determine your surroundings, and warrior.shoot! to fire an arrow.
ru_ro: Используйте warrior.look определить ваше окружение, и warrior.shoot! стрелять стрелку.

source: Walk backward if you are taking damage from afar and do not have enough health to attack. You may also want to consider walking backward until $warrior->feel(':backward')->is_wall().
ru_ro: Прогулка назад, если вы принимаете повреждения издалека и не хватает здоровья для атаки. Вы также можете рассмотреть ходьбе назад, пока $ Warrior-> чувство ('': назад) -> is_wall ().

source: When there is no enemy ahead of you call \$warrior->rest() until health is full before walking forward.
ru_ro: Когда нет врагов впереди вы звоните \ $ Warrior-> Остальные () до тех пор, пока здоровье полна прежде, чем идти вперед.

source: You can walk backward by passing ':backward' as an argument to walk!. Same goes for feel, rescue! and attack!. Archers have a limited attack distance.
ru_ro: Вы можете ходить назад, передавая ": назад" в качестве аргумента, чтобы идти !. То же самое касается чувства, помощь! и атака !. Лучники имеют ограниченное расстояние атаки.

source: binds %$1s and restricts %$2s
ru_ro: связывает% $ 1s и ограничивает% $ 2s
